In [12]:
import pandas as pd

In [13]:
df = pd.read_csv('Social_Network_Ads.xls')
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [14]:
df.columns

Index(['User ID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

In [15]:
from sklearn import preprocessing

label_encoder = preprocessing.LabelEncoder()
df['Gender']= label_encoder.fit_transform(df['Gender'])
  
df['Gender'].unique()

array([1, 0])

In [16]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510       1   19            19000          0
1  15810944       1   35            20000          0
2  15668575       0   26            43000          0
3  15603246       0   27            57000          0
4  15804002       1   19            76000          0

In [17]:
features=['User ID', 'Gender', 'Age', 'EstimatedSalary']
X = df[features]
X.head()

    User ID  Gender  Age  EstimatedSalary
0  15624510       1   19            19000
1  15810944       1   35            20000
2  15668575       0   26            43000
3  15603246       0   27            57000
4  15804002       1   19            76000

In [34]:
y = df.Purchased
y.head()

0    0
1    0
2    0
3    0
4    0
Name: Purchased, dtype: int64

In [35]:
from sklearn.model_selection import train_test_split
train_X, test_X, train_y, test_y = train_test_split(X, y, test_size=0.3, random_state=0)

In [36]:
from sklearn.naive_bayes import GaussianNB

classifier = GaussianNB()
classifier.fit(train_X, train_y)
y_pred = classifier.predict(train_X)
classifier.score(test_X, test_y)

0.8833333333333333